/**
 *  ファイル名
 *		AsuraX.h
 *  説明
 *		AsuraXのキネマティクスクラス
 *  日付
 *		作成日: 2007/04/01(SAT)		更新日: 2007/04/01(SAT)
 */

#ifndef __AsuraX_h__
#define __AsuraX_h__

/**
 *	----------------------------------------------------------------------
 *		ヘッダファイルインクルード
 *	----------------------------------------------------------------------
 */
#include "WalkingRobot.h"

namespace Asura
{
/**
 *	----------------------------------------------------------------------
 *		AsuraXクラス
 *	----------------------------------------------------------------------
 */
class AsuraX : public WalkingRobot
{
/**
 *	------------------------------------------------------------
 *		メンバ変数
 *	------------------------------------------------------------
 */
private:

/**
 *	------------------------------------------------------------
 *		メンバ関数
 *	------------------------------------------------------------
 */
public:
	/// デフォルトコンストラクタ
	AsuraX();
	explicit AsuraX(const Math::Vector& bodyPosition);

	/// デストラクタ
	virtual ~AsuraX();

private:
};	/// end of class Asura

}	/// end of namespace Asura


#endif	/// __Asura_h__
