/**
 *  ファイル名
 *		JoyPadState.cpp
 *  説明
 *		ジョイパッドの状態を保持するクラス
 *  日付
 *		作成日: 2008/03/10(MON)		更新日: 2008/03/10(MON)
 */

/**
 *	----------------------------------------------------------------------
 *		ヘッダファイルインクルード
 *	----------------------------------------------------------------------
 */
#include "JoyPadState.h"

/**
 *	----------------------------------------------------------------------
 *		JoyPadStateクラス
 *	----------------------------------------------------------------------
 */

/**
 *	------------------------------------------------------------
 *		JoyPadStateクラスのメンバ関数定義
 *	------------------------------------------------------------
 */

/**
 *	----------------------------------------
 *	コンストラクタとデストラクタ
 *	----------------------------------------
 */
/**
 *	コンストラクタ
 */
JoyPadState::JoyPadState()
{
	clear();
}

/**
 *	デストラクタ
 */
JoyPadState::~JoyPadState()
{
}

void JoyPadState::clear(void)
{
	/// 軸の並進値
	AxisTransX = AxisTransY = AxisTransZ;

	/// 軸の回転値
	AxisRotX = AxisRotY = AxisRotZ;
	
	int i;
	for (i=0; i<DIJOY_MAX_BUTTON_NUM; i++) { buttons[i] = false; }
}
