/**
 *  ファイル名
 *		ComLib.cpp
 *  説明
 *		COMライブラリクラス
 *  日付
 *		作成日: 2008/03/10(MON)		更新日: 2008/03/10(MON)	
 */


/**
 *	----------------------------------------------------------------------
 *		ヘッダファイルインクルード
 *	----------------------------------------------------------------------
 */
 #include "ComLib.h"
 
 
/**
 *	------------------------------------------------------------
 *		ComLibクラスのstatic変数の初期化
 *	------------------------------------------------------------
 */
int ComLib::refCounter;

/**
 *	----------------------------------------------------------------------
 *		ComLibクラス
 *	----------------------------------------------------------------------
 */

/**
 *	------------------------------------------------------------
 *		ComLibクラスのメンバ関数定義
 *	------------------------------------------------------------
 */
/**
 *	COMライブラリ初期化
 */
bool ComLib::initialize(void)
{
	refCounter++;
	
	if (refCounter == 1)
	{
		if (::CoInitialize(NULL) != S_OK)
		{
			::OutputDebugString( TEXT("Error: [ComLib::initialize] Initialization failed\n") );
			refCounter = 0;
			
			return false;
		}
	}
	
	return true;	
}


/**
 *	COMライブラリ解放
 */
void ComLib::uninitialize(void)
{
	if ( refCounter <= 0) return;

	refCounter--;
	
	if (refCounter == 0)
		::CoUninitialize();	
}
