/**
 *  ファイル名
 *		TimeManager.h
 *  説明
 *		計画のための時間管理をするクラス
 *  日付
 *		作成日: 2007/09/01(SAT)		更新日: 2008/10/04(SAT)
 */

#ifndef __TimeManager_h__ 
#define __TimeManager_h__

/**
 *	----------------------------------------------------------------------
 *		ヘッダファイルインクルード
 *	----------------------------------------------------------------------
 */
#include <iostream>

namespace Plan
{

/**
 *	----------------------------------------------------------------------
 *		TimeManagerクラス
 *	----------------------------------------------------------------------
 */
class TimeManager
{
/**
 *	------------------------------------------------------------
 *		メンバ変数
 *	------------------------------------------------------------
 */
public:

private:
/**
 *		実時間 [msec]
 */
	static double realTime;

/**
 *	------------------------------------------------------------
 *		メンバ関数
 *	------------------------------------------------------------
 */
public:
/**
 *	----------------------------------------
 *	コンストラクタとデストラクタ
 *	----------------------------------------
 */
	/// デフォルトコンストラクタ
	TimeManager();
	virtual ~TimeManager();

/**
 *	----------------------------------------
 *	セット関数
 *	----------------------------------------
 */
	static void setRealTime(double time);

/**
 *	----------------------------------------
 *	アクセス関数
 *	----------------------------------------
 */
	static double getRealTime(void) {return (realTime);}

protected:
private:
	/// コピーコンストラクタ無効
	TimeManager(const TimeManager& timeManager);

	/// 代入演算子無効
	TimeManager& operator=(const TimeManager& timeManager);

};		/// end of class TimeManager

}		/// end of namespace 

#endif // __TimeManager_h__